#writed by wei_java
#-*- coding:utf-8 –*
def loadDataSet():
    '''''创建一个用于测试的简单的数据集'''
    return [['山茱萸', '龙骨', '桂枝', '淫羊藿', '赤芍', '泽泻', '茯苓', '白术', '蜜炙甘草', '干姜', '熟附片', '南葶苈子', '赤芍', '熟附片', '干姜', '蜜炙甘草', '蜜炙甘草', '白术', '茯苓', '龙骨', '山茱萸', '苦杏仁', '淫羊藿', '当归', '赤芍', '赤芍', '泽泻', '茯苓', '白术', '蜜炙甘草', '龙骨', '桂枝', '干姜', '熟附片', '熟地黄', '党参', '当归', '巴戟天', '蜜炙甘草', '干姜', '熟附片', '益智(益智仁)', '茯苓', '桂枝', '白术', '天麻', '白芷', '山药', '黄连', '木香', '砂仁', '炒薏苡仁', '蜜炙甘草', '陈皮(橘皮)', '桂枝', '檀香', '瓦楞子', '淫羊藿', '补骨脂', '佛手', '郁金（广郁金）', '乌梅', '制香附', '干姜', '草蒲黄炭(包煎)(蒲黄炭）', '葛根', '土鳖虫(地鳖虫)', '丹参', '红花', '巴戟天', '蜜炙甘草', '干姜', '熟附片', '党参', '益智(益智仁)', '茯苓', '山茱萸', '桂枝', '白术', '当归', '赤芍', '南葶苈子', '苦杏仁', '山茱萸', '茯苓', '白术', '蜜炙甘草', '干姜', '熟附片', '薤白', '泽泻'],['熟附片', '香橼', '佛手', '郁金（广郁金）', '生蒲黄(包煎）', '豆蔻(后下)', '降香', '丹参', '枳壳', '枳实', '桂枝', '薤白', '瓜蒌子', '瓜蒌皮', '山茱萸', '补骨脂', '北沙参', '南沙参', '麦冬', '瓦楞子', '酸枣仁', '桃仁', '茯神', '茯神', '黄芪', '南葶苈子', '车前子'],['黄精', '杜仲', '杜仲', '瓜蒌皮', '当归', '麦冬', '牛膝(怀牛膝)', '牛膝(怀牛膝)', '消胀方(无太子参)', '厚朴', '枳实', '瓜蒌子', '生牡蛎', '浙贝母(象贝)', '制半夏', '黄连', '南葶苈子(包煎）', '桂枝', '熟附片', '枳壳', '白术', '白芍', '柴胡', '黄芪', '车前子', '延胡索', '生蒲黄(包煎）', '甘草', '郁金（广郁金）', '瓜蒌皮', '砂仁(后下）', '降香(后下）', '丹参', '枳壳', '葛根', '黄连', '补骨脂', '黄精', '白芍(炒白芍)', '柴胡', '当归', '杜仲', '杜仲', '牛膝(怀牛膝)', '茯苓', '党参', '黄芪', '生蒲黄(包煎）', '瓜蒌皮', '桂枝', '蜜炙甘草', '浙贝母(象贝)', '豆蔻(后下）', '降香(后下）', '丹参'],['茯苓', '首乌藤(夜交藤)', '珍珠母', '酸枣仁', '制半夏', '补骨脂', '豆蔻', '降香', '丹参', '黄连', '生蒲黄(包煎）', '生稻芽', '当归', '黄精', '覆盆子', '益智(益智仁)', '南葶苈子', '白芍', '白术', '鹿角', '熟附片', '黄芪', '丹参', '川芎', '黄芪', '牛膝(怀牛膝)', '茯苓', '地龙', '车前草', '车前子', '黄芩', '黄芩', '甘草', '浙贝母(象贝)', '瓜蒌皮', '豆蔻', '降香', '制半夏', '南葶苈子', '白芍', '白术', '熟附片', '降香', '泽兰', '菟丝子', '鹿衔草', '六月雪', '覆盆子', '南葶苈子', '白芍', '白术', '黄精', '丹参', '茯苓', '首乌藤(夜交藤)', '珍珠母', '酸枣仁', '制半夏', '补骨脂', '豆蔻', '泽泻', '车前子', '益智(益智仁)', '黄连', '生蒲黄(包煎）', '生稻芽', '当归', '鹿角', '熟附片', '黄芪', '熟附片', '地黄', '熟地黄', '黄芪', '党参', '钩藤', '钩藤', '黄芩', '丹参', '泽泻', '泽兰', '车前子', '茯苓', '南葶苈子', '白芍', '白术', '桂枝', '蜜炙甘草', '龙齿', '首乌藤(夜交藤)', '知母', '川芎', '柏子仁', '酸枣仁', '豆蔻', '降香'],['大腹毛（大腹皮）', '煅白螺蛳壳', '生稻芽', '炒芥子', '酸枣仁', '苦杏仁', '山药', '黄芩', '黄芩', '瓜蒌子', '瓜蒌皮', '浙贝母(象贝)', '枸杞子', '玉竹', '竹沥半夏', '连翘', '当归', '金荞麦（开金锁）', '金荞麦（开金锁）', '车前子', '茯苓', '猪苓', '白芍', '白术', '南葶苈子', '知母', '熟地黄', '地黄', '麦冬', '熟附片', '黄芪', '大枣', '灵芝', '山茱萸', '地黄', '半枝莲', '干姜', '白花蛇舌草', '蛇六谷', '莪术', '三棱', '蜜炙甘草', '金樱子根', '六神曲', '六神曲', '山楂炭', '山楂炭', '芡实', '芡实', '炙鸡内金', '炙鸡内金', '朱茯苓', '朱茯苓', '茯苓', '制半夏', '豆蔻', '砂仁', '白扁豆', '白扁豆', '枳壳', '枳壳', '苍术', '苍术', '白术', '防风', '山药', '陈皮(橘皮)', '青皮', '党参', '炒稻芽(炒谷芽)', '泽泻', '车前子', '浙贝母(象贝)', '香橼', '炙枇杷叶', '丹参', '海浮石', '麦冬', '北沙参', '生蒲黄(包煎）', '茯苓', '熟地黄', '当归', '黄芩', '黄芩', '南沙参', '南沙参', '白芍', '白术', '熟附片', '黄芪', '竹沥半夏', '瓜蒌皮', '瓜蒌子', '金荞麦（开金锁）', '金荞麦（开金锁）', '泽兰', '泽泻', '生薏苡仁', '附子', '麦冬', '五加皮', '黄芪', '炙甘草', '甘草', '葶苈子', '香橼', '怀牛膝', '菟丝子', '山茱萸', '孩儿参', '黄芩', '白芍', '白术', '车前子', '茯苓', '猪苓', '桑白皮', '瓜蒌皮', '鳖甲', '地龙', '大腹毛（大腹皮）', '生稻芽', '当归', '蜜炙升麻', '柴胡', '石菖蒲', '生槐米', '金荞麦（开金锁）', '茵陈', '蜜炙甘草', '甘草', '枳实', '泽兰', '车前子', '炒麦芽', '菊花(白菊花)', '山茱萸', '枸杞子', '麦冬', '香橼', '地黄', '桂枝', '南葶苈子', '党参', '黄芪', '生槐米', '仙鹤草', '制大黄', '制大黄', '茯苓', '白芍', '白术', '泽泻', '丹参', '蔊菜', '金荞麦（开金锁）'],['酸枣仁', '桃仁', '柴胡', '白术', '黄连', '牡丹皮(丹皮)', '丹参', '黄芪', '土鳖虫(地鳖虫)', '地龙', '牡丹皮(丹皮)', '苦参', '生蒲黄(包煎）', '阿胶(东阿)烊冲', '桂枝', '麦冬', '景天三七', '槲寄生', '菝葜', '熟附片', '茯苓', '地黄', '蜜炙甘草', '淫羊藿', '白芍', '黄芩', '炙枇杷叶', '瓦楞子', '浙贝母(象贝)', '鳖甲', '甘松', '猪苓', '黄柏', '知母', '当归', '川芎', '猪苓', '黄柏', '知母', '熟附片', '茯苓', '桃仁', '柴胡', '牡丹皮(丹皮)', '丹参', '当归', '川芎', '酸枣仁', '黄连', '苦参', '生蒲黄(包煎）', '阿胶(东阿)烊冲', '桂枝', '麦冬', '地黄', '蜜炙甘草', '淫羊藿', '白芍', '白术', '黄芪', '土鳖虫(地鳖虫)', '地龙', '牡丹皮(丹皮)', '黄芩', '炙枇杷叶', '瓦楞子', '浙贝母(象贝)', '鳖甲', '甘松', '景天三七', '槲寄生', '菝葜'],['山茱萸', '山茱萸', '煅磁石(煅灵磁石)', '脐带条', '党参', '白术', '茯苓', '炒麦芽', '肉苁蓉', '熟附片', '干姜', '蜜炙甘草'],['煅磁石(煅灵磁石)', '红花', '桃仁去皮', '川芎', '孩儿参', '党参', '黄芪', '枣仁', '牛膝(怀牛膝)', '天麻', '炙甘草', '鹿角片', '竹沥半夏', '补骨脂', '淫羊霍', '葛根', '枳壳', '柴胡', '郁金（广郁金）', '南葶苈子(葶苈子)', '车前子', '生地', '柏子仁', '丹参'],['蜜炙甘草', '当归', '蜜炙升麻', '柴胡', '白芍', '白术', '党参', '黄芪', '黄精', '薤白', '沉香', '枳壳', '六神曲', '六神曲', '麦冬', '砂仁', '檀香', '丹参', '制半夏', '薤白', '桂枝', '豆蔻', '降香', '丹参', '郁金（广郁金）', '瓜蒌皮', '瓜蒌皮', '车前草', '黄柏', '知母', '茯苓', '槲寄生', '槲寄生', '菊花(白菊花)', '龙齿', '玉竹', '钩藤', '钩藤', '杜仲', '杜仲', '酸枣仁', '车前子', '熟附片', '南葶苈子', '白芍', '白术', '黄芪'],[ '丹参', '车前子', '葶苈子', '茯苓', '白芍', '白术', '附子', '黄芪', '瓜蒌子', '瓜蒌皮', '象贝', '桑白皮', '钩藤', '半夏', '杞子', '熟地', '柴胡', '生蒲黄包煎', '西砂仁后下', '降香', '生谷芽', '柏子仁', '桃仁去皮', '孩儿参', '首乌', '杏仁去皮', '黄芩'],['天麻', '地鳖虫', '莪术', '三棱', '地龙', '川芎', '枣仁', '桃仁去皮', '柴胡', '黄芪', '佛手', '麦冬', '黄柏', '知母', '杜仲', '蜈蚣条', '全蝎', '当归', '桂枝', '丹参', '丹皮', '白芍', '白术', '茯苓', '猪苓', '附子', '茯苓', '南葶苈子', '车前子', '熟附片', '黄芪', '煅白螺蛳壳', '桂枝', '薤白', '瓜蒌皮', '瓜蒌子', '香橼', '预知子', '苦参', '珍珠母(先煎）', '茶树根', '豆蔻(后下)', '檀香', '丹参', '白芍', '生白术', '佛手', '麦冬', '天麻', '地鳖虫', '莪术', '三棱', '川芎', '枣仁', '桃仁去皮', '柴胡', '黄芪', '白芍', '白术', '茯苓', '猪苓', '附子', '黄柏', '知母', '杜仲', '蜈蚣条', '全蝎', '地龙', '当归', '桂枝', '丹参', '丹皮', '牡丹皮(丹皮)', '丹参', '当归', '猪苓', '白芍', '白术', '佛手', '熟附片', '鹿角', '茯苓', '川芎', '酸枣仁', '桃仁', '柴胡', '黄连', '车前子', '黄柏[关]', '知母', '补骨脂', '黄芪', '骨碎补（毛姜）', '淫羊藿', '莪术', '三棱', '地龙', '生蒲黄(包煎）', '党参', '葛根', '杜仲'],['火麻仁', '猪苓', '制大黄', '升麻', '升麻', '杜仲', '杜仲', '制狗脊', '生栀子', '枳壳', '柴胡', '川芎', '天麻', '合欢皮', '石菖蒲', '石菖蒲', '远志', '白术', '麦冬', '天麻', '郁李仁', '郁李仁', '煅牡蛎', '煅龙骨', '茯苓', '桂枝', '桂枝', '黄芩', '制半夏', '火麻仁', '石斛(川石斛)', '牡丹皮(丹皮)', '丹参', '当归', '酸枣仁', '桃仁', '远志', '首乌藤(夜交藤)', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪', '土鳖虫(地鳖虫)', '地龙', '白芍', '熟附片', '黄柏', '知母', '生蒲黄(包煎）', '厚朴', '黄连', '车前子', '鹿角', '当归', '丹参', '杜仲', '补骨脂', '补骨脂', '茯苓', '猪苓', '川芎', '白芍', '白术', '熟附片', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪', '土鳖虫(地鳖虫)', '地龙', '牡丹皮(丹皮)', '酸枣仁', '桃仁', '柴胡'],['生蒲黄(包煎）', '鳖甲', '鳖甲', '莪术', '三棱', '陈皮(橘皮)', '党参', '升麻', '桂枝', '桂枝', '黄连', '南葶苈子(包煎）', '泽泻', '黄柏(关)', '知母', '生白术', '土鳖虫(地鳖虫)', '黄芪', '淫羊藿', '骨碎补（毛姜）', '骨碎补（毛姜）', '牡丹皮(丹皮)', '牡丹皮(丹皮)', '酸枣仁', '桃仁', '葛根', '白芍(炒白芍)', '生白术', '地龙', '丹参', '当归', '川芎', '柴胡', '车前子', '鹿角(先煎）', '杜仲', '补骨脂', '补骨脂', '茯苓', '猪苓', '熟附片', '熟附片'],['升麻', '柴胡', '生山楂', '淡豆豉', '佛手', '川楝子', '苁蓉', '茯苓', '炒麦芽', '橘皮', '炙甘草', '半夏', '厚朴', '党参', '白术', '泽泻', '杞子', '生首乌', '枳壳', '柴胡', '橘皮', '当归', '苁蓉', '南沙参', '北沙参', '白术', '党参', '炙黄芪', '肉桂后下', '附子', '炙黄芪', '桂枝', '茯苓', '黄芩', '益智仁', '白术', '党参', '补骨脂', '枳壳', '炙甘草', '半夏', '橘红', '黄芩', '蜜炙甘草', '枳壳', '珍珠母', '枣仁', '首乌藤(夜交藤)', '川芎', '天麻', '丹参', '葛根', '荷叶', '黄芪', '六神曲', '六神曲', '生山楂', '凤凰衣', '连翘', '瓦楞子', '吴茱萸', '柴胡', '黄连', '钩藤', '香橼', '白芍', '白术', '防风', '干姜', '熟附片', '川楝子', '龙骨', '柴胡', '陈皮(橘皮)', '山茱萸', '党参', '制何首乌', '肉苁蓉', '蜜炙甘草', '肉苁蓉', '熟附片', '肉桂', '熟地黄', '山药', '山茱萸', '山茱萸', '当归', '蜜炙黄芪', '枸杞子', '升麻', '白术', '党参', '骨碎补（毛姜）', '续断（川断）', '厚朴', '制狗脊', '土鳖虫(地鳖虫)', '制天南星', '鹿衔草', '石斛(川石斛)', '白术', '知母', '白芍', '桂枝', '牛膝(怀牛膝)', '牛膝(怀牛膝)', '桃仁', '土茯苓', '蒲公英', '制半夏', '干姜', '佛手', '竹茹', '鹿角(先煎）', '黄芪', '半夏', '橘红', '桂枝', '茯苓', '黄芩', '炙黄芪', '党参', '补骨脂', '枳壳', '炙甘草', '益智仁', '白术', '肉桂后下', '附子', '茯苓', '半夏', '橘皮', '当归', '枳壳', '白术', '生首乌', '苁蓉', '炙黄芪', '菟丝子', '杞子', '胡芦巴', '补骨脂'],['甘草', '白芍', '竹茹', '陈皮(橘皮)', '制胆星', '瓜蒌子', '瓜蒌皮', '郁金（广郁金）', '薤白', '桂枝', '灵芝', '煅白螺蛳壳', '黄芪', '熟附片', '车前子', '丹参', '南葶苈子', '降香', '砂仁', '制半夏', '茯苓', '黄连'],['凤凰衣', '连翘', '白芍', '茯苓', '车前子', '甘草', '熟附片', '枳壳', '珍珠母', '柴胡', '丹参', '降香', '瓜蒌皮', '郁金（广郁金）', '猪苓', '石斛(川石斛)', '麦冬', '竹沥半夏', '钩藤', '钩藤', '豆蔻', '白术', '黄芪', '金沸草', '黄连'],['牡丹皮(丹皮)', '丹参', '当归', '煅白螺蛳壳', '金沸草', '升麻', '红景天', '白芷', '浙贝母(象贝)', '生蒲黄(包煎）', '熟附片', '豆蔻', '檀香', '黄柏[关]', '知母', '黄连', '厚朴', '竹茹', '枳壳', '茯苓', '黄芩', '竹沥半夏', '陈皮(橘皮)', '川芎', '白芍', '白术', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪', '桃仁', '柴胡', '土鳖虫(地鳖虫)', '地龙', '煅白螺蛳壳', '金沸草', '升麻', '红景天', '白芷', '浙贝母(象贝)', '生蒲黄(包煎）', '熟附片', '豆蔻', '檀香', '黄柏[关]', '知母', '黄连', '厚朴', '竹茹', '枳壳', '茯苓', '黄芩', '竹沥半夏', '陈皮(橘皮)', '川芎', '白芍', '白术', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪', '土鳖虫(地鳖虫)', '地龙', '牡丹皮(丹皮)', '丹参', '当归', '桃仁', '柴胡', '柴胡', '桃仁', '当归', '丹参', '牡丹皮(丹皮)', '地龙', '土鳖虫(地鳖虫)', '黄芪', '熟附片', '生蒲黄(包煎）', '浙贝母(象贝)', '豆蔻', '檀香', '黄柏[关]', '知母', '黄连', '厚朴', '竹茹', '枳壳', '茯苓', '黄芩', '竹沥半夏', '陈皮(橘皮)', '川芎', '白芍', '白术', '淫羊藿', '骨碎补（毛姜）', '葛根', '柴胡', '桃仁', '当归', '丹参', '牡丹皮(丹皮)', '地龙', '土鳖虫(地鳖虫)', '黄芪', '葛根', '骨碎补（毛姜）', '淫羊藿', '白术', '白芍', '川芎', '陈皮(橘皮)', '竹沥半夏', '黄芩', '茯苓', '枳壳', '竹茹', '厚朴', '黄连', '知母', '黄柏[关]', '檀香', '豆蔻', '熟附片', '生蒲黄(包煎）', '浙贝母(象贝)'],['香橼', '桂枝', '黄精', '黄精', '生蒲黄(包煎）', '豆蔻', '降香', '丹参', '车前子', '党参', '黄芪', '蜜炙甘草', '甘草', '麦冬', '茯苓', '白芍', '白术', '南葶苈子', '熟附片', '炙鸡内金', '六神曲', '山楂炭', '制半夏', '太子参(孩儿参)', '车前子', '南葶苈子', '麦冬', '六神曲', '山楂炭', '蜜炙甘草', '甘草', '茯苓', '白芍', '白术', '黄连', '熟附片', '生蒲黄(包煎）', '黄芪', '豆蔻', '降香', '丹参'],['干姜', '鳖甲', '鳖甲', '熟附片', '鸡血藤', '苦参', '乌梅', '乌梢蛇', '白鲜皮', '白鲜皮', '地肤子', '地肤子', '枳壳', '菟丝子', '杜仲', '升麻', '黄柏[关]', '知母', '牛膝(怀牛膝)', '枸杞子', '麦冬', '天冬', '太子参(孩儿参)', '川芎', '白芍', '白术', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪', '牡丹皮(丹皮)', '丹参', '当归', '酸枣仁', '桃仁', '柴胡', '牡丹皮(丹皮)', '丹参', '当归', '酸枣仁', '桃仁', '柴胡', '苦参', '乌梅', '乌梅', '防风', '僵蚕', '乌梢蛇', '白鲜皮', '白鲜皮', '地肤子', '地肤子', '枳壳', '菟丝子', '杜仲', '升麻', '黄柏[关]', '知母', '牛膝(怀牛膝)', '枸杞子', '麦冬', '天冬', '太子参(孩儿参)', '川芎', '白芍', '白术', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪'],['枳壳', '赤芍', '泽泻', '巴戟天', '茯苓', '干姜', '附子', '炙麻黄', '橘皮', '西砂仁后下', '白术', '党参', '桂枝', '干姜', '党参', '白术', '西砂仁后下', '茯苓', '白扁豆', '橘皮', '炙甘草', '炒薏苡仁', '半夏', '补骨脂', '肉桂后下', '当归', '脐带条', '白术', '炙黄芪', '粉龙骨先煎', '山茱萸', '桂枝', '炙甘草', '干姜', '附子', '生牡蛎先煎', '橘皮', '炙麻黄', '茯苓', '猪苓', '西砂仁后下'],['丹参', '降香', '白豆蔻后下', '黄芪', '白术', '白芍', '枳实', '瓜蒌子', '熟地', '桃仁去皮', '枣仁', '知母', '黄柏', '瓜蒌皮', '钩藤', '麦冬', '杞子', '茯苓', '川芎', '广郁金', '生蒲黄包煎', '孩儿参', '红枣', '葶苈子', '生蒲黄包煎', '白术', '白芍', '黄芪', '党参', '附子', '葶苈子', '红枣', '桂枝', '丹参', '黄柏', '车前子', '枳壳', '柴胡', '补骨脂', '黄精', '生地', '玉米须', '夜交藤', '甘草', '炙甘草', '茯神', '茯苓', '川芎', '知母', '柏子仁', '枣仁', '黄连', '香橼', '白龙齿先煎', '白豆蔻后下', '降香'],['钩藤', '麦冬', '黄连', '枳壳', '白芍', '柴胡', '生稻芽', '太子参(孩儿参)', '蜜炙甘草', '桂枝', '郁金（广郁金）', '瓜蒌皮', '瓜蒌皮', '生蒲黄(包煎）', '豆蔻', '降香', '丹参', '黄芪'],['牛膝(怀牛膝)', '仙鹤草', '玉米须', '党参', '诃子', '百合', '芦根', '黄芪', '六神曲', '炒谷芽', '炒麦芽', '龙葵', '山慈姑', '白花蛇舌草', '半枝莲', '杞子', '杞子', '灵芝', '当归', '川芎', '白芍', '生地', '甘草', '茯苓', '白术', '山茱萸', '山药'],['炙鸡内金', '生蒲黄(包煎）', '灵芝', '瘪桃干', '葛根', '钩藤', '枳壳', '首乌藤(夜交藤)', '合欢皮', '柴胡', '制半夏', '黄芩', '桂枝', '桂枝', '茯苓', '制大黄', '党参', '猪苓', '煅龙骨', '煅牡蛎', '地黄', '巴戟天', '当归', '知母', '黄柏[关]', '白芍', '白术', '北沙参', '黄芪', '熟附片', '代代花', '玫瑰花', '淫羊藿', '桂枝', '黄芩', '制半夏', '柴胡', '合欢皮', '首乌藤(夜交藤)', '枳壳', '钩藤', '葛根', '瘪桃干', '灵芝', '生蒲黄(包煎）', '炙鸡内金', '白芍', '白术', '北沙参', '黄芪', '熟附片', '代代花', '玫瑰花', '淫羊藿', '黄柏[关]', '知母', '当归', '巴戟天', '地黄', '煅牡蛎', '煅龙骨', '猪苓', '党参', '制大黄', '茯苓', '桂枝', '酸枣仁', '桃仁', '柴胡', '枳壳', '煅白螺蛳壳', '山药', '红景天', '蜈蚣条', '全蝎', '竹沥半夏', '天麻', '茯苓', '熟附片', '黄柏[关]', '知母', '豆蔻', '檀香', '生蒲黄(包煎）', '川芎', '白芍', '白术', '淫羊藿', '骨碎补（毛姜）', '葛根', '黄芪', '土鳖虫(地鳖虫)', '地龙', '牡丹皮(丹皮)', '丹参', '当归', '当归', '丹参', '牡丹皮(丹皮)', '地龙', '土鳖虫(地鳖虫)', '黄芪', '葛根', '骨碎补（毛姜）', '淫羊藿', '白术', '白芍', '川芎', '生蒲黄(包煎）', '檀香', '豆蔻', '知母', '黄柏[关]', '熟附片', '茯苓', '天麻', '竹沥半夏', '全蝎', '蜈蚣条', '红景天', '山药', '煅白螺蛳壳', '枳壳', '柴胡', '桃仁', '酸枣仁'],['党参', '干姜', '熟附片', '白扁豆', '炒麦芽', '柴胡', '厚朴', '川楝子', '三棱', '丹参', '茯苓', '熟附片', '赤芍', '茯苓', '党参', '蜜炙甘草', '干姜', '制何首乌', '川楝子', '白术'],['黄芪', '脐带条', '粉龙骨先煎', '生牡蛎先煎', '西砂仁后下', '山茱萸', '白术', '茯苓', '白芍', '桂枝', '炙甘草', '干姜', '附子'],['鹿角片先煎', '香橼', '山茱萸', '玉米须', '杜仲', '党参', '黄连', '石菖蒲', '远志', '炒薏苡仁', '生薏苡仁', '黄柏', '知母', '泽泻', '地鳖虫', '白芍', '白术', '地龙', '丹参', '丹皮', '当归', '川芎', '车前子', '茯苓', '猪苓', '附子', '淫羊霍', '毛姜', '枣仁', '桃仁去皮', '黄芪', '柴胡', '酸枣仁', '桃仁', '柴胡', '车前子', '鹿角', '杜仲', '补骨脂', '补骨脂', '茯苓', '蜜炙甘草', '淫羊藿', '葛根', '黄芪', '土鳖虫(地鳖虫)', '地龙', '牡丹皮(丹皮)', '丹参', '当归', '脐带条', '黄连', '黄柏', '知母', '桂枝', '桂枝', '南葶苈子', '泽泻', '生蒲黄(包煎）', '首乌藤(夜交藤)', '猪苓', '川芎', '白芍', '白术', '熟附片', '熟附片'],['黄芩', '黄芩', '赤芍', '茯苓', '枸杞子', '桂枝', '太子参(孩儿参)', '黄芪', '香橼', '光杏仁', '光桃仁', '槲寄生', '槲寄生', '菟丝子', '蜜炙甘草', '甘草', '熟地', '生地', '玉竹', '麦冬', '生蒲黄(包煎）', '豆蔻', '降香', '丹参']]


def createC1(dataSet):
    '''''
        构建初始候选项集的列表，即所有候选项集只包含一个元素，
        C1是大小为1的所有候选项集的集合
    '''
    C1 = []
    for transaction in dataSet:
        for item in transaction:
            if [item] not in C1:
                C1.append([item])
    C1.sort()
    # return map( frozenset, C1 )
    # return [var for var in map(frozenset,C1)]
    return [frozenset(var) for var in C1]


def scanD(D, Ck, minSupport):
    '''''
        计算Ck中的项集在数据集合D(记录或者transactions)中的支持度,
        返回满足最小支持度的项集的集合，和所有项集支持度信息的字典。
    '''
    ssCnt = {}
    for tid in D:  # 对于每一条transaction
        for can in Ck:  # 对于每一个候选项集can，检查是否是transaction的一部分 # 即该候选can是否得到transaction的支持
            if can.issubset(tid):
                ssCnt[can] = ssCnt.get(can, 0) + 1
    numItems = float(len(D))
    retList = []
    supportData = {}
    for key in ssCnt:
        support = ssCnt[key] / numItems  # 每个项集的支持度
        if support >= minSupport:  # 将满足最小支持度的项集，加入retList
            retList.insert(0, key)
        supportData[key] = support  # 汇总支持度数据
    return retList, supportData


def aprioriGen(Lk, k):  # Aprior算法
    '''''
        由初始候选项集的集合Lk生成新的生成候选项集，
        k表示生成的新项集中所含有的元素个数
    '''
    retList = []
    lenLk = len(Lk)
    for i in range(lenLk):
        for j in range(i + 1, lenLk):
            L1 = list(Lk[i])[: k - 2];
            L2 = list(Lk[j])[: k - 2];
            L1.sort();
            L2.sort()
            if L1 == L2:
                retList.append(Lk[i] | Lk[j])
    return retList


def apriori(dataSet, minSupport=0.5):
    C1 = createC1(dataSet)  # 构建初始候选项集C1
    # D = map( set, dataSet )                                 # 将dataSet集合化，以满足scanD的格式要求
    # D=[var for var in map(set,dataSet)]
    D = [set(var) for var in dataSet]
    L1, suppData = scanD(D, C1, minSupport)  # 构建初始的频繁项集，即所有项集只有一个元素
    L = [L1]  # 最初的L1中的每个项集含有一个元素，新生成的
    k = 2  # 项集应该含有2个元素，所以 k=2

    while (len(L[k - 2]) > 0):
        Ck = aprioriGen(L[k - 2], k)
        Lk, supK = scanD(D, Ck, minSupport)
        suppData.update(supK)  # 将新的项集的支持度数据加入原来的总支持度字典中
        L.append(Lk)  # 将符合最小支持度要求的项集加入L
        k += 1  # 新生成的项集中的元素个数应不断增加
    return L, suppData  # 返回所有满足条件的频繁项集的列表，和所有候选项集的支持度信息


def calcConf(freqSet, H, supportData, brl, minConf=0.7):  # 规则生成与评价
    '''''
        计算规则的可信度，返回满足最小可信度的规则。
        freqSet(frozenset):频繁项集
        H(frozenset):频繁项集中所有的元素
        supportData(dic):频繁项集中所有元素的支持度
        brl(tuple):满足可信度条件的关联规则
        minConf(float):最小可信度
    '''
    prunedH = []
    for conseq in H:
        conf = supportData[freqSet] / supportData[freqSet - conseq]
        if conf >= minConf:
            print(freqSet - conseq, '-->', conseq, 'conf:', conf)
            brl.append((freqSet - conseq, conseq, conf))
            prunedH.append(conseq)
    return prunedH


def rulesFromConseq(freqSet, H, supportData, brl, minConf=0.7):
    '''''
        对频繁项集中元素超过2的项集进行合并。
        freqSet(frozenset):频繁项集
        H(frozenset):频繁项集中的所有元素，即可以出现在规则右部的元素
        supportData(dict):所有项集的支持度信息
        brl(tuple):生成的规则
    '''
    m = len(H[0])
    if len(freqSet) > m + 1:  # 查看频繁项集是否足够大，以到于移除大小为 m的子集，否则继续生成m+1大小的频繁项集
        Hmp1 = aprioriGen(H, m + 1)
        Hmp1 = calcConf(freqSet, Hmp1, supportData, brl, minConf)  # 对于新生成的m+1大小的频繁项集，计算新生成的关联规则的右则的集合
        if len(Hmp1) > 1:  # 如果不止一条规则满足要求（新生成的关联规则的右则的集合的大小大于1），进一步递归合并，
            # 这样做的结果就是会有“[1|多]->多”(右边只会是“多”，因为合并的本质是频繁子项集变大，
            # 而calcConf函数的关联结果的右侧就是频繁子项集）的关联结果
            rulesFromConseq(freqSet, Hmp1, supportData, brl, minConf)


def generateRules(L, supportData, minConf=0.7):
    '''''
        根据频繁项集和最小可信度生成规则。
        L(list):存储频繁项集
        supportData(dict):存储着所有项集（不仅仅是频繁项集）的支持度
        minConf(float):最小可信度
    '''
    bigRuleList = []
    for i in range(1, len(L)):
        for freqSet in L[i]:  # 对于每一个频繁项集的集合freqSet
            H1 = [frozenset([item]) for item in freqSet]
            if i > 1:  # 如果频繁项集中的元素个数大于2，需要进一步合并，这样做的结果就是会有“[1|多]->多”(右边只会是“多”，
                # 因为合并的本质是频繁子项集变大，而calcConf函数的关联结果的右侧就是频繁子项集），的关联结果
                rulesFromConseq(freqSet, H1, supportData, bigRuleList, minConf)
            else:
                calcConf(freqSet, H1, supportData, bigRuleList, minConf)
    return bigRuleList


if __name__ == '__main__':
    myDat = loadDataSet()  # 导入数据集
    # C1 = createC1( myDat )                                  # 构建第一个候选项集列表C1
    # D = map( set, myDat )                                   # 构建集合表示的数据集 D，python3中的写法，或者下面那种
    # D=[var for var in map(set,myDat)]
    # D=[set(var) for var in myDat] #D: [{1, 3, 4}, {2, 3, 5}, {1, 2, 3, 5}, {2, 5}]
    # L, suppData = scanD( D, C1, 0.5 )                       # 选择出支持度不小于0.5 的项集作为频繁项集
    # print(u"频繁项集L：", L)
    # print(u"所有候选项集的支持度信息：", suppData)
    # print("myDat",myDat)
    L, suppData = apriori(myDat, 0.7)  # 选择频繁项集
    print(u"频繁项集L：", L)
    print(u"所有候选项集的支持度信息：", suppData)
    rules = generateRules(L, suppData, minConf=0.7)
    print('rules:\n', rules)